	module VAR
; + 
key_binding:				
		db	'W'		; up
		db	'S'		; down
		db	'A'		; left
		db	'D'		; right
		db	'B'		; BOM
		db	ENTER		; action

; + Таблица смещения горизонтальных символов экрана кратных 12 пикселям.
scr_offset_x:	
		db	0,1,3,4,6,7,9,10,12,13,15,16,18,19,21,22
; + Таблица крайних левых адресов экрана кратных 12 линиям.
scr_addr_y:
		dw	#4000
		dw	#4420
		dw	#4060
		dw	#4480
		dw	#40C0
		dw	#44E0

		dw	#4820
		dw	#4C40
		dw	#4880
		dw	#4CA0
		dw	#48E0

		dw	#5400
		dw	#5040
		dw	#5460
		dw	#50A0
		dw	#54C0
; + Адреса всех атрибутов всех индексов уровней при выборе уровня.
level_indices_attr_addr:

		dw	#584A, #584E, #5852, #5856, #585A
		dw	#586A, #586E, #5872, #5876, #587A
		dw	#588A, #588E, #5892, #5896, #589A
		dw	#58AA, #58AE, #58B2, #58B6, #58BA
		dw	#58CA, #58CE, #58D2, #58D6, #58DA
		dw	#58EA, #58EE, #58F2, #58F6, #58FA
		dw	#590A, #590E, #5912, #5916, #591A
		dw	#592A, #592E, #5932, #5936, #593A
		dw	#594A, #594E, #5952, #5956, #595A
		dw	#596A, #596E, #5972, #5976, #597A
		dw	#598A, #598E, #5992, #5996, #599A
		dw	#59AA, #59AE, #59B2, #59B6, #59BA
		dw	#59CA, #59CE, #59D2, #59D6, #59DA
		dw	#59EA, #59EE, #59F2, #59F6, #59FA
		dw	#5A0A, #5A0E, #5A12, #5A16, #5A1A
		dw	#5A2A, #5A2E, #5A32, #5A36, #5A3A
		dw	#5A4A, #5A4E, #5A52, #5A56, #5A5A
		dw	#5A6A, #5A6E, #5A72, #5A76, #5A7A
		dw	#5A8A, #5A8E, #5A92, #5A96, #5A9A
		dw	#5AAA, #5AAE, #5AB2, #5AB6, #5ABA

; + Адреса всех атрибутов всех индексов миров при выборе уровня.
world_indices_attr_addr:
		dw	#5843
		dw	#5863
		dw	#5883
		dw	#58A3
		dw	#58C3
		dw	#58E3
		dw	#5903
		dw	#5923
		dw	#5943
		dw	#5963

; + Таблицы таймеров кадров для анимации вылетающих строк меню в главном меню.
; + первая половина таймеров для начала всех строк, вторая для конца всех строк.  
; + Значения означают сколько должно пройти кадров что бы начать анимацию для каждой строки (начала строки и ее конца)
mm_moving_strings_frames:
		db	0
		db	2
		db	4
		db	18
		db	20
		db	22
mm_moving_strings_scr_addrs:
		dw	#407E
		dw	#40BE
		dw	#40FE
		dw	#407E
		dw	#40BE
		dw	#40FE
; + общее окл-во кадров на всю анимацию вылетающих строк.
mm_moves:
		db	24

	endmodule